In [1]:
import pandas as pd
import json
import configparser
import psycopg2

In [2]:
config =configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

In [3]:
KEY = config.get("ACCESS","KEY")

SECRET = config.get("ACCESS","SECRET")

DWH_CLUSTER_TYPE       = config.get("DWH","DWH_CLUSTER_TYPE")
DWH_NUM_NODES          = config.get("DWH","DWH_NUM_NODES")
DWH_NODE_TYPE          = config.get("DWH","DWH_NODE_TYPE")
DWH_CLUSTER_IDENTIFIER = config.get("DWH","DWH_CLUSTER_ID")



DWH_ENDPOINT           = config.get("CLUSTER","host")

DWH_DB                 = config.get("CLUSTER","DB_NAME")
DWH_DB_USER            = config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DWH_PORT               = config.get("CLUSTER","DB_PORT")

DWH_IAM_ROLE_NAME      = config.get("DWH", "ROLE_NAME")

In [4]:
%reload_ext sql

In [5]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://charles:Obamly01@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb

'Connected: charles@dwhdb'

In [29]:
%sql SELECT * FROM staging_events_table order by ts desc LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
5 rows affected.

[(9014, 'Deas Vail', 'Logged In', 'Elijah', 'M ', 0, 'Davis', 237.688, 'free', 'Detroit-Warren-Dearborn, MI', 'PUT', None, 'NextSong', 1540772343796, 985, 'Anything You Say (Unreleased Version)', 200, 1543607664796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 5),
 (9006, None, 'Logged In', 'Rylan', 'M ', 61, 'George', None, 'paid', 'Birmingham-Hoover, AL', 'GET', None, 'Downgrade', 1541020249796, 1076, None, 200, 1543603993796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 16),
 (8998, 'Anberlin', 'Logged In', 'Rylan', 'M ', 60, 'George', 348.682, 'paid', 'Birmingham-Hoover, AL', 'PUT', None, 'NextSong', 1541020249796, 1076, 'The Haunting', 200, 1543603884796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 16),
 (8990, 'A Perfect Circle', 'Logged In', 'Rylan', 'M ', 59, 'George', 206.053, 'paid', 'Birmingham-Hoover, AL', 'PUT', None, 'NextSong', 1541020249796, 1076, 'Rose', 200, 1543603678796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 16),
 (8982, 'Timbiriche', 'Logged In', 'Rylan', 'M ', 58, 'George', 202.605, 'paid', 'Birmingham-Hoover, AL', 'PUT', None, 'NextSong', 1541020249796, 1076, 'Besos De Ceniza', 200, 1543603476796, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 16)]

In [31]:
%sql SELECT DISTINCT ('1970-01-01 00:00:00 GMT'::timestamp + (((ts/1000::int)::text)::interval)) AS start_time \
     from staging_events_table order by ts asc LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 20, 57, 10),),
 (datetime.datetime(2018, 11, 1, 21, 1, 46),),
 (datetime.datetime(2018, 11, 1, 21, 2, 12),),
 (datetime.datetime(2018, 11, 1, 21, 5, 52),),
 (datetime.datetime(2018, 11, 1, 21, 8, 16),)]

In [6]:
%sql SELECT count(*) FROM staging_events_table where page='NextSong' LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(6820,)]

In [7]:
%sql select * from stv_wlm_service_class_config where service_class >= 100;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(100, 'Predicted Time queue policy     ', -1, -1, 'true    ', 0, -1, -1, 5, 'Default queue                                                   ', 0, 'false   ', 'false   ', 'off                 ', 'Normal              ')]

In [9]:
%sql select a.queue_start_time, a.total_exec_time, label, trim(querytxt) \
from stl_wlm_query a, stl_query b \
where a.query = b.query and a.service_class >= 100 and a.final_state = 'Completed' \
order by b.query asc limit 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(datetime.datetime(2021, 3, 18, 20, 7, 5, 369447), 112963625, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_songs_table from 's3://udacity-dend/song_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 18, 20, 8, 58, 346376), 5239192, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 18, 20, 9, 3, 632075), 239721, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 18, 20, 9, 4, 182694), 15189857, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_events_table from 's3://udacity-dend/log_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 18, 20, 9, 19, 383859), 6407355, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 18, 20, 9, 25, 848146), 65927, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 18, 20, 9, 26, 240696), 8266814, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO dimUsers (userId,firstName,lastName,gender,level) SELECT DISTINCT userId, firstName, lastName, gender,level FROM staging_events_table WHERE page = 'NextSong';"),
 (datetime.datetime(2021, 3, 18, 20, 9, 34, 971257), 5558508, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'INSERT INTO dimArtists (artist_id,artist_name,location,latitude,longitude) SELECT DISTINCT artist_id,artist_name,artist_location,artist_latitude,artist_longitude FROM staging_songs_table;'),
 (datetime.datetime(2021, 3, 18, 21, 0, 14, 913636), 122877499, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_songs_table from 's3://udacity-dend/song_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 18, 21, 2, 17, 801176), 34598, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 18, 21, 2, 17, 882305), 18459, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 18, 21, 2, 18, 444137), 756584, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_events_table from 's3://udacity-dend/log_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 18, 21, 2, 19, 208333), 33668, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 18, 21, 2, 19, 298056), 24050, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 18, 21, 2, 20, 508061), 27543, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO dimUsers (userId,firstName,lastName,gender,level) SELECT DISTINCT userId, firstName, lastName, gender,level FROM staging_events_table WHERE page = 'NextSong';"),
 (datetime.datetime(2021, 3, 18, 21, 2, 20, 971669), 36354, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'INSERT INTO dimArtists (artist_id,artist_name,location,latitude,longitude) SELECT DISTINCT artist_id,artist_name,artist_location,artist_latitude,artist_longitude FROM staging_songs_table;'),
 (datetime.datetime(2021, 3, 18, 21, 2, 21, 461472), 6513121, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO dimTimes (start_time,hour,day,week,month,year,weekday) SELECT DISTINCT ('1970-01-01 00:00:00 GMT'::timestamp + (ts::text)::interval) AS s ... (457 characters truncated) ... ar, EXTRACT(weekday from ('1970-01-01 00:00:00 GMT'::timestamp + (ts::text)::interval)) AS weekday FROM staging_events_table WHERE page = 'NextSong';"),
 (datetime.datetime(2021, 3, 18, 21, 2, 28, 465063), 5784158, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'INSERT INTO dimSongs (song_id,title,artist_id,year,duration) SELECT DISTINCT song_id,title,artist_id,year,duration FROM staging_songs_table;'),
 (datetime.datetime(2021, 3, 18, 21, 2, 34, 711478), 9961844, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO songplay (start_time,userId,level,song_id, artist_id,sessionId,location,userAgent) SELECT DISTINCT '1970-01-01 00:00:00 GMT'::timestamp + ... (101 characters truncated) ... on,e.userAgent FROM staging_events_table AS e JOIN staging_songs_table AS s ON (e.artist=s.artist_name AND e.song=s.title) WHERE e.page = 'NextSong';"),
 (datetime.datetime(2021, 3, 18, 21, 9, 24, 585628), 4942465, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "SELECT DISTINCT ('1970-01-01 00:00:00 GMT'::timestamp + (ts::text)::interval) AS start_time FROM staging_events_table;")]

In [10]:
%sql select query, service_class as svclass, service_class_start_time as starttime, query_priority \
from stl_wlm_query order by 3 asc limit 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(3, 1, datetime.datetime(2021, 3, 18, 20, 0, 11, 906789), 'Normal              '),
 (5, 2, datetime.datetime(2021, 3, 18, 20, 0, 28, 461406), 'Normal              '),
 (7, 2, datetime.datetime(2021, 3, 18, 20, 0, 29, 607022), 'Normal              '),
 (9, 2, datetime.datetime(2021, 3, 18, 20, 0, 32, 254401), 'Normal              '),
 (11, 2, datetime.datetime(2021, 3, 18, 20, 0, 34, 822334), 'Normal              '),
 (13, 1, datetime.datetime(2021, 3, 18, 20, 0, 36, 824750), 'Normal              '),
 (15, 1, datetime.datetime(2021, 3, 18, 20, 0, 37, 472816), 'Normal              '),
 (17, 3, datetime.datetime(2021, 3, 18, 20, 0, 38, 28276), 'Normal              '),
 (19, 1, datetime.datetime(2021, 3, 18, 20, 0, 38, 536993), 'Normal              '),
 (21, 3, datetime.datetime(2021, 3, 18, 20, 0, 38, 849377), 'Normal              '),
 (23, 3, datetime.datetime(2021, 3, 18, 20, 0, 39, 820343), 'Normal              '),
 (25, 3, datetime.datetime(2021, 3, 18, 20, 0, 40, 613585), 'Normal              '),
 (27, 3, datetime.datetime(2021, 3, 18, 20, 0, 41, 833387), 'Normal              '),
 (29, 3, datetime.datetime(2021, 3, 18, 20, 0, 42, 693437), 'Normal              '),
 (31, 2, datetime.datetime(2021, 3, 18, 20, 2, 56, 276893), 'Normal              '),
 (33, 2, datetime.datetime(2021, 3, 18, 20, 2, 56, 368505), 'Normal              '),
 (35, 2, datetime.datetime(2021, 3, 18, 20, 2, 56, 805721), 'Normal              '),
 (37, 2, datetime.datetime(2021, 3, 18, 20, 2, 57, 340259), 'Normal              '),
 (39, 2, datetime.datetime(2021, 3, 18, 20, 2, 57, 442213), 'Normal              '),
 (41, 1, datetime.datetime(2021, 3, 18, 20, 3, 6, 63420), 'Normal              ')]

In [11]:
%sql SELECT count(*) FROM staging_events_table where page='NextSong' LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(6820,)]

In [12]:
%sql SELECT count(*) FROM staging_events_table LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(8056,)]

In [13]:
%sql SELECT count(*) FROM staging_songs_table LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(14896,)]

In [14]:
%sql SELECT DISTINCT userId,firstName,lastName,song FROM staging_events_table \
                    WHERE page = 'NextSong' order by userId ASC LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(2, 'Jizelle', 'Benjamin', 'Self Control (Laurent Wolf & Anton Wick)'),
 (2, 'Jizelle', 'Benjamin', 'Love Stinks'),
 (2, 'Jizelle', 'Benjamin', 'Pienso En Ti'),
 (2, 'Jizelle', 'Benjamin', "Tell Me When The Party's Over/Prequiem"),
 (2, 'Jizelle', 'Benjamin', 'Runaway (Album Version)'),
 (2, 'Jizelle', 'Benjamin', 'Hurt Me Soul (Explicit Album Version)'),
 (2, 'Jizelle', 'Benjamin', 'Macarena'),
 (2, 'Jizelle', 'Benjamin', 'Pet Semetary'),
 (2, 'Jizelle', 'Benjamin', 'Spark My Soul (feat. Substantial)'),
 (2, 'Jizelle', 'Benjamin', "The Lady Is A Tramp (From 'Babes In Arms')"),
 (3, 'Isaac', 'Valdez', 'Pop Corn'),
 (3, 'Isaac', 'Valdez', 'Strasbourg'),
 (3, 'Isaac', 'Valdez', 'Adios'),
 (4, 'Alivia', 'Terrell', 'Something Happened On The Way To Heaven'),
 (4, 'Alivia', 'Terrell', 'Read My Mind'),
 (4, 'Alivia', 'Terrell', 'Chicken Hawk'),
 (4, 'Alivia', 'Terrell', "I'm Sorry"),
 (4, 'Alivia', 'Terrell', 'Bracelets (LP Version)'),
 (5, 'Elijah', 'Davis', 'Skin Is_ My'),
 (5, 'Elijah', 'Davis', 'Anything You Say (Unreleased Version)')]

In [15]:
%sql SELECT a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a \
          ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id) \
                    group by artist_name,title order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('Dwight Yoakam', "You're The One", 22),
 ('Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 9),
 ('B.o.B', "Nothin' On You [feat. Bruno Mars] (Album Version)", 7),
 ('Ron Carter', "I CAN'T GET STARTED", 6),
 ('Kid Cudi', 'Up Up & Away', 5),
 ('Kid Cudi', 'Make Her Say', 5),
 ('Usher', "Hey Daddy (Daddy's Home)", 4),
 ('Muse', 'Supermassive Black Hole (Album Version)', 4),
 ('matchbox twenty', 'Unwell (Album Version)', 4),
 ('Counting Crows', 'Mr. Jones', 4)]

In [17]:
%sql SELECT level AS user_level, a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a \
          ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id)\
                    group by level,artist_name,title order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('paid', 'Dwight Yoakam', "You're The One", 16),
 ('free', 'Dwight Yoakam', "You're The One", 7),
 ('paid', 'B.o.B', "Nothin' On You [feat. Bruno Mars] (Album Version)", 7),
 ('paid', 'Ron Carter', "I CAN'T GET STARTED", 6),
 ('paid', 'Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 5),
 ('paid', 'matchbox twenty', 'Unwell (Album Version)', 4),
 ('paid', 'Counting Crows', 'Mr. Jones', 4),
 ('paid', 'Kid Cudi', 'Make Her Say', 4),
 ('free', 'Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 4),
 ('paid', 'Muse', 'Supermassive Black Hole (Album Version)', 4)]

In [18]:
%sql SELECT level AS user_level, location, count(DISTINCT(userId)) AS number_of_users FROM songplay \
        group by level,location order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('free', 'New York-Newark-Jersey City, NY-NJ-PA', 3),
 ('free', 'Houston-The Woodlands-Sugar Land, TX', 3),
 ('paid', 'Atlanta-Sandy Springs-Roswell, GA', 2),
 ('free', 'Columbia, SC', 2),
 ('free', 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', 2),
 ('paid', 'Waterloo-Cedar Falls, IA', 1),
 ('paid', 'Red Bluff, CA', 1),
 ('paid', 'Winston-Salem, NC', 1),
 ('free', 'Birmingham-Hoover, AL', 1),
 ('free', 'Yuba City, CA', 1)]

In [19]:
%sql SELECT userId FROM songplay WHERE userId = 3 LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
0 rows affected.

[]

In [20]:
%sql SELECT DISTINCT userId,firstName,lastName FROM dimUsers LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(2, 'Jizelle', 'Benjamin'),
 (3, 'Isaac', 'Valdez'),
 (4, 'Alivia', 'Terrell'),
 (5, 'Elijah', 'Davis'),
 (6, 'Cecilia', 'Owens'),
 (7, 'Adelyn', 'Jordan'),
 (8, 'Kaylee', 'Summers'),
 (9, 'Wyatt', 'Scott'),
 (10, 'Sylvie', 'Cruz'),
 (11, 'Christian', 'Porter'),
 (12, 'Austin', 'Rosales'),
 (13, 'Ava', 'Robinson'),
 (14, 'Theodore', 'Harris'),
 (15, 'Lily', 'Koch'),
 (16, 'Rylan', 'George'),
 (17, 'Makinley', 'Jones'),
 (18, 'Jacob', 'Rogers'),
 (19, 'Zachary', 'Thomas'),
 (20, 'Aiden', 'Ramirez'),
 (22, 'Sean', 'Wilson')]

In [21]:
%sql SELECT count(*) FROM dimSongs LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(14896,)]

In [22]:
%sql SELECT count(*) FROM dimArtists LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(10025,)]

In [33]:
%sql SELECT * FROM dimTimes order by start_time desc LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
5 rows affected.

[(datetime.datetime(2018, 11, 30, 19, 54, 24), 19, 30, 48, 11, 2018, '5'),
 (datetime.datetime(2018, 11, 30, 18, 51, 24), 18, 30, 48, 11, 2018, '5'),
 (datetime.datetime(2018, 11, 30, 18, 47, 58), 18, 30, 48, 11, 2018, '5'),
 (datetime.datetime(2018, 11, 30, 18, 44, 36), 18, 30, 48, 11, 2018, '5'),
 (datetime.datetime(2018, 11, 30, 18, 40, 5), 18, 30, 48, 11, 2018, '5')]

Example queries

Number of free users and paid users

In [34]:
%sql SELECT level, COUNT (level) FROM songplay GROUP BY level ;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
2 rows affected.

[('free', 62), ('paid', 271)]

What hour has the highest traffic

In [35]:
%sql SELECT dimTimes.hour, COUNT (dimTimes.hour) AS hour_count FROM (songplay JOIN dimTimes ON \
                                    songplay.start_time=dimTimes.start_time)\
            GROUP BY dimTimes.hour  ORDER BY hour_count DESC;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
24 rows affected.

[(17, 40),
 (18, 26),
 (15, 25),
 (16, 24),
 (8, 18),
 (20, 18),
 (19, 16),
 (14, 16),
 (11, 16),
 (13, 14),
 (7, 13),
 (12, 12),
 (21, 12),
 (23, 11),
 (10, 11),
 (1, 11),
 (9, 9),
 (6, 9),
 (4, 7),
 (5, 7),
 (22, 7),
 (0, 6),
 (2, 3),
 (3, 2)]

How many different songs were played by each user?

In [36]:
%sql SELECT songplay.userId, songplay.level, COUNT (DISTINCT(songplay.song_id)) AS user_count FROM \
                    (songplay JOIN dimUsers ON  songplay.userId=dimUsers.userId) \
                    GROUP BY songplay.userId, songplay.level ORDER BY user_count DESC LIMIT 15;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
15 rows affected.

[(49, 'paid', 34),
 (80, 'paid', 30),
 (97, 'paid', 27),
 (44, 'paid', 21),
 (88, 'paid', 16),
 (73, 'paid', 15),
 (15, 'paid', 13),
 (29, 'paid', 13),
 (36, 'paid', 12),
 (24, 'paid', 11),
 (25, 'paid', 9),
 (58, 'paid', 9),
 (30, 'paid', 8),
 (95, 'paid', 8),
 (85, 'paid', 7)]

How many songs were played from the most played artist?

In [37]:
%sql SELECT songplay.artist_id, dimArtists.artist_name, COUNT (songplay.song_id) AS songcount FROM (songplay JOIN dimArtists ON \
                                    songplay.artist_id=dimArtists.artist_id)\
            GROUP BY songplay.artist_id,dimArtists.artist_name  ORDER BY songcount DESC LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
5 rows affected.

[('AR5E44Z1187B9A1D74', 'Dwight Yoakam', 37),
 ('ARD46C811C8A414F3F', 'Kid Cudi', 10),
 ('AR37SX11187FB3E164', 'Ron Carter', 9),
 ('AR5EYTL1187B98EDA0', 'Lonnie Gordon', 9),
 ('ARKQQZA12086C116FC', 'B.o.B', 8)]